[
  {
    "id": 1,
    "title": "Il est possible de connaître les nouveaux contenus ou services",
    "authors": ["Marco BARONI"],
    "path": "/rules/1",
    "description": "Une image vaut souvent mieux qu’un long discours. Certes, mais tout d’abord, il peut s’avérer difficile de véritablement comprendre un graphique (courbe, diagramme, histogramme, camembert...) si l’on n'a pas les données qui ont permis de le créer. D’autre part, certains utilisateurs ne pourront pas avoir accès au rendu graphique, et l’accès aux données leur permettra de comprendre les contenus.",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "SEO",
      "Écoconception"
    ],
    "objectives": [
      "Permettre aux utilisateurs d'identifier immédiatement les nouveaux contenus ou services en ligne.",
      "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
    ],
    "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
    "implementation": [
      "Publier un flux RSS des actualités du site.",
      "Publier une rubrique du type « Actualités du site » ou « Quoi de neuf ? »",
      "Indiquer un compte de réseau social ou un canal d'actualité où sont publiées les actualités concernant le site."
    ],
    "control": [
      "Vérifier qu’un canal interne existe (flux RSS, rubrique « Quoi de neuf ? », etc.).",
      "Vérifier qu’un canal externe est accessible depuis la page d’accueil (si utilisé)."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 2,
    "title": "Les informations importantes sont accessibles et compréhensibles",
    "path": "/rules/2",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "UX",
      "SEO"
    ],
    "objective": "Assurer que les informations essentielles sont facilement accessibles et compréhensibles pour tous les utilisateurs, y compris ceux ayant des besoins spécifiques."
  },
  {
    "id": 10,
    "title": "Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif.",
    "authors": ["Marco BARONI"],
    "path": "/rules/10",
    "description": "Il est fort agaçant de voir publier un message sous une forme dégradée ou de constater après envoi que l’on a écrit une grosse bêtise. La prévisualisation permet de voir les contenus en contexte et donne la possibilité de les corriger ou de les peaufiner.",
    "tags": ["Contenus", "Développement"],
    "objectives": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi.",
      "Diminuer le nombre de demandes de rectification ou de suppression."
    ],
    "implementationIntro": "Mettre en place une prévisualisation des informations saisies avant la soumission définitive du formulaire, avec possibilité de les modifier.",
    "implementation": [],
    "control": [
      "Pour chaque espace public du site (zone de commentaire, forum, page personnelle publique, avatar, portfolio de documents, etc.) :",
      "Saisir des informations destinées à être rendues publiques telles que des images associées à un compte ou un commentaire.",
      "Vérifier que la soumission définitive du formulaire de saisie est précédée d'une étape permettant, si l'utilisateur le souhaite, de contrôler et de modifier le résultat de sa saisie avant publication."
    ],
    "screenshotsSources": [
      "https://www.gmail.com/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 87,
    "title": "Les processus complexes sont accompagnés de la liste de leurs étapes.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/87",
    "description": "Il est toujours appréciable de connaître à l’avance le nombre d’étapes et de pouvoir estimer le temps nécessaire pour réaliser une longue démarche",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Donner de la visibilité à l'utilisateur sur les actions qu'il va réaliser (ordre des étapes, informations nécessaires pour les accomplir, etc.). ",
      "Éviter que l'utilisateur ne se sente piégé dans un processus dont il n'avait pas prévu la durée."
    ],
    "implementationIntro": "Pour tout processus complexe, par exemple un formulaire de commande, afficher à chaque étape la liste intégrale de toutes ses étapes.",
    "implementation": [],
    "control": [
      "Vérifier, pour chaque page concernée, que la liste des étapes y est indiquée, en règle générale sous forme d'un chemin d'étapes en tête de page ou de formulaire."
    ],
    "screenshotsSources": []
  },
  {
    "id": 88,
    "title": "L'étape en cours d'un processus complexe est indiquée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/88",
    "description": "Ne vous êtes-vous jamais demandé, au beau milieu d’une démarche un peu longue répartie sur plusieurs formulaires successifs, où vous étiez exactement ?",
    "tags": ["Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre à l'utilisateur d'identifier le degré d'avancement dans un processus.",
      "Rassurer l'utilisateur lors de la réalisation d'un processus complexe."
    ],
    "implementationIntro": "Préciser sur chaque page du processus l'étape correspondant à la page en cours.",
    "implementation": [],
    "control": [
      "Dans le cas de processus complexes, vérifier, pour chaque page concernée, que l'étape en cours y est indiquée",
      "Dans le titre de page",
      "Dans le contenu de page, sous la forme d'une mise en évidence dans le chemin d'étapes en tête de page ou de formulaire, par exemple « Étape 2 – Coordonnées » ou « Étape 4 – Paiement »."
    ],
    "screenshotsSources": []
  },
  {
    "id": 89,
    "title": "Chaque étape d'un processus complexe permet de revenir à l'étape précédente.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/89",
    "description": "Après avoir décidé de passer à l’étape suivante d’un processus complexe, il arrive souvent d’avoir besoin de vérifier ce qu’on a saisi précédemment. Laissez aux internautes la possibilité de douter, de vérifier, et de se tromper, bien sûr.",
    "tags": ["Accessibilité","Développement", "Conception", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Réduire les risques d’erreurs de saisie. Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Fournir à chaque étape du formulaire un bouton de navigation permettant de retourner à l’étape précédente.",
    "implementation": [],
    "control": [
      "Vérifier manuellement la possibilité de revenir à chaque étape précédente du processus."
    ],
    "screenshotsSources": []
  },
  {
    "id": 90,
    "title": "L'utilisateur est averti de la perte d'information en cas d'utilisation de l'historique de son navigateur dans un processus complexe.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/90",
    "description": "Ne vous est-il jamais arrivé de croire que vous pouviez tout simplement retourner voir ce que vous aviez saisi à l’étape précédente lors de votre déclaration d’impôts, par exemple, et de constater peu après que tout ce que vous aviez saisi avant ce remords était perdu ? Évitons ce genre de déception à nos utilisateurs.",
    "tags": ["Basics", "Accessibilité", "Conception","Développement", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Générer une alerte JavaScript en cas de l’utilisation de la fonctionnalité « back » de l’historique du navigateur. ",
    "implementation": [],
    "control": [
      "Amorcer la saisie d’un formulaire après la première étape du processus, puis activer le bouton « back » du navigateur."
    ],
    "screenshotsSources": []
  },
  {
    "id": 91,
    "title": "La navigation dans un processus complexe ne provoque pas la perte des données précédemment soumises.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/91",
    "description": "Il est certes extrêmement confortable pour l’utilisateur de pouvoir naviguer dans les différentes étapes d’un processus complexe. Il est évidemment essentiel de l’avertir lorsque des données peuvent être perdues. C’est d’ailleurs l’objet d’une autre des règles assurance qualité web. Il est encore plus utile de s’assurer que l’ensemble des données saisies par l’utilisateur sont enregistrées à tout moment.",
    "tags": ["Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie et sa correction dans les formulaires répartis par étapes.",
      "Limiter les risques d’abandon en cours de procédure."
    ],
    "implementationIntro": "Prévoir, au niveau de la gestion de la navigation dans les étapes du processus, l’enregistrement des données saisies à chaque étape, de manière à pouvoir afficher à nouveau celle-ci sans perte de données après que l’utilisateur a utilisé le mécanisme de navigation dans les étap",
    "implementation": [],
    "control": [
      "Utiliser le mécanisme de navigation dans les étapes précédentes de la saisie et vérifier manuellement que les données saisies à chaque étape sont conservées et affichées à nouveau par la suite. "
    ],
    "screenshotsSources": []
  },
  {
    "id": 92,
    "title": "Le copier coller est possible dans les champs de formulaire.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/92",
    "description": "Saisissez votre adresse e-mail. C’est bon, c’est fait ? Et si maintenant je vous demande de la saisir de nouveau, vous allez peut-être avoir la flemme de le faire et voudrez la copier depuis le premier champ pour la coller dans le deuxième. De quel droit certains sites voudraient-ils vous empêcher de faire cela ? Vive le copier-coller libre !",
    "tags": ["Basics", "Accessibilité", "Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie dans les formulaires."
    ],
    "implementationIntro": "",
    "implementation": [
      "Ne pas intercepter les événements JavaScript onpaste ou keydown pour bloquer le coller dans un champ de formulaire.",
      "Ne pas intercepter les événements JavaScript oncopy ou oncut pour bloquer le copier dans un champ de formulaire."
    ],
    "control": [
      "Vérifier qu’il est possible de copier le contenu de chaque champ y compris les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire).",
      "Vérifier qu’il est possible de coller un contenu dans chaque champ y compris dans les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 93,
    "title": "Les éléments d'une liste déroulante qui peuvent être regroupés le sont de manière appropriée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/93",
    "description": "Le contenu de certaines listes déroulantes est suffisamment homogène pour se suffire à lui-même, mais, dans certains cas, la liste sera plus aisée à consulter en étant mieux organisée. Dans ce cas, l’élément optgroup est votre ami.",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre aux aides techniques de restituer à l’utilisateur une liste dont l’organisation est clairement perceptible et qui facilite le passage d’un élément de la liste à un autre.",
      "Favoriser un rendu approprié des listes déroulantes complexes dans tous les navigateurs.",
      "Améliorer l’accessibilité des contenus aux personnes handicapées"
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser l'élément optgroup pour baliser les regroupements thématiques d'éléments option dans les listes sel",
      "Utiliser l'attribut label de l'élément optgroup pour afficher l'étiquette de chaque regroupement."
    ],
    "control": [
      "Ouvrir chaque liste (select) pour détecter celles qui nécessiteraient un regroupement d'éléments option, par exemple des regroupements de modèles de voitures classés par marques ou des regroupements de villes réalisés par département ",
      "Vérifier, en examinant le code source à l'aide de Firebug, que chaque série d'éléments option qui devraient être regroupés est balisée avec l'élément optgroup",
      "Vérifier que chaque élément optgroup est doté d'un attribut label associant un libellé pertinent au groupe d'options concern"
    ],
    "screenshotsSources": []
<<<<<<< HEAD
  },
  {
    "id": 131,
    "title": "La langue principale de la page cible d'un lien est identifiable lorsqu'elle diffère de celle de la page d'origine.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/131",
    "description": "Arriver par surprise sur une page en klingon quand on ne parle pas cette langue n’est jamais très agréable. Peu d’informations permettent aux internautes de savoir ce qui se cache derrière un lien. Toutes les informations qui vont être transmises avant le clic sont donc de nature à limiter les clics inutiles. La langue en est une qui gagne à être précisée à l’avance.",
    "tags": ["Accessibilité", "Contenus", "Liens", "Internationalisation"],
    "objectives": [
      "Permettre à l'utilisateur d'anticiper la langue du contenu vers lequel il se dirige.",
      "Éviter la frustration d'ouvrir une page incompréhensible.",
      "Améliorer l'accessibilité pour les utilisateurs naviguant avec des lecteurs d'écran."
    ],
    "implementationIntro": "",
    "implementation": [
      "Indiquer la langue de la cible via une mention textuelle (ex: [en], [pdf en anglais]) ou une icône explicite.",
      "Utiliser l'attribut hreflang sur la balise a pour les robots, mais ne pas s'y fier pour l'affichage visuel."
    ],
    "control": [
      "Vérifier que tout lien menant vers une page dans une langue différente possède une indication visible avant le clic.",
      "Contrôler la pertinence de l'information (ne pas indiquer [en] si la page est en français)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 132,
    "title": "Chaque changement de langue est signalé.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/132",
    "description": "Les outils automatiques et les robots qui parcourent vos contenus ne peuvent pas forcément en deviner la langue principale ni ses éventuelles variations. La présence d’un terme en langue étrangère dans une page peut et doit être signalé.",
    "tags": ["Accessibilité", "Développement", "Contenus", "Internationalisation"],
    "objectives": [
      "Permettre aux synthèses vocales de prononcer correctement les passages en langue étrangère.",
      "Permettre aux outils de traduction de traiter correctement les contenus.",
      "Faciliter l'indexation par les moteurs de recherche."
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser l'attribut lang sur les balises HTML entourant le contenu en langue étrangère (span, q, blockquote, div, etc.)."
    ],
    "control": [
      "Identifier les changements de langue dans le contenu.",
      "Vérifier la présence de l'attribut lang approprié sur l'élément conteneur."
    ],
    "screenshotsSources": []
  },
  {
    "id": 133,
    "title": "Les liens d'accès aux versions traduites pointent directement vers la traduction de la page courante.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/133",
    "description": "En matière d’internationalisation, cette bonne pratique représente le confort ultime. Sur chaque page, vous pouvez directement cliquer sur le lien de changement de langue et c’est la page traduite qui apparaît. C’est intéressant pour l’internaute et c’est également très pratique pour le contrôle des traductions.",
    "tags": ["Accessibilité", "Internationalisation", "Navigation", "UX"],
    "objectives": [
      "Permettre à l'utilisateur de changer de langue sans perdre le fil de sa navigation.",
      "Éviter de forcer l'utilisateur à rechercher à nouveau la page qu'il consultait après avoir changé de langue."
    ],
    "implementationIntro": "",
    "implementation": [
      "Configurer le système de gestion de contenu (CMS) pour lier les pages traduites entre elles.",
      "Générer dynamiquement le lien de changement de langue en fonction de l'URL courante (ex: /fr/contact -> /en/contact)."
    ],
    "control": [
      "Se rendre sur une page profonde du site (pas l'accueil).",
      "Changer de langue via le sélecteur.",
      "Vérifier que l'on atterrit bien sur la version traduite de cette même page, et non sur l'accueil."
    ],
    "screenshotsSources": []
  },
  {
    "id": 134,
    "title": "Les liens vers les versions équivalentes des contenus sont rédigés dans leur langue cible.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/134",
    "description": "Si vous faites un lien vers une page en hongrois, il y a de fortes chances que cette page s’adresse à des lecteurs qui comprennent le hongrois. Faites donc un libellé de lien en hongrois. Et ô merveille, ça marche aussi pour les autres langues.",
    "tags": ["Accessibilité", "Internationalisation", "Éditorial", "UX"],
    "objectives": [
      "Permettre à un utilisateur ne maîtrisant pas la langue courante de trouver facilement sa propre langue.",
      "Améliorer la navigation internationale."
    ],
    "implementationIntro": "",
    "implementation": [
      "Rédiger l'intitulé du lien dans la langue de destination (ex: 'English' au lieu de 'Anglais', 'Deutsch' au lieu de 'Allemand').",
      "Respecter la casse et les caractères spéciaux de la langue cible (ex: '日本語' pour le Japonais)."
    ],
    "control": [
      "Vérifier le menu de choix de langue.",
      "S'assurer que chaque langue est nommée dans sa propre langue (autonyme)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 135,
    "title": "Le serveur respecte l'ordre préférentiel de langues des outils de consultation.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/135",
    "description": "Chaque requête auprès d’un serveur peut comporter des informations concernant les préférences de langue. Chaque internaute peut classer ses langues préférées dans son navigateur. Le serveur doit proposer les contenus en respectant l’ordre demandé par l’utilisateur. Si celui-ci indique le français, puis l’espagnol, puis l’anglais, le serveur devra servir la page en français si elle existe, sinon en espagnol si elle existe, et sinon en anglais si elle existe.",
    "tags": ["Développement", "Serveur", "Internationalisation", "HTTP"],
    "objectives": [
      "Servir automatiquement le contenu dans la langue préférée de l'utilisateur sans action de sa part.",
      "Améliorer l'expérience utilisateur dès la première visite."
    ],
    "implementationIntro": "",
    "implementation": [
      "Configurer le serveur (Apache, Nginx) ou le backend pour lire l'en-tête HTTP 'Accept-Language'.",
      "Implémenter une logique de négociation de contenu pour servir la langue correspondante disponible."
    ],
    "control": [
      "Configurer son navigateur pour demander une langue spécifique (ex: Espagnol).",
      "Accéder au site et vérifier qu'il s'affiche automatiquement dans cette langue (si disponible)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 136,
    "title": "Chaque lien est doté d'un intitulé dans le code source.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/136",
    "description": "Un lien se compose au minimum d’une URL et d’un libellé. Si vous ne saisissez pas de libellé, vous avez un lien, certes, mais qui n'a pas de sens et qui risque de ne pas être perçu ou d’être incorrectement compris par les utilisateurs et les moteurs de recherche.",
    "tags": ["Accessibilité", "Développement", "SEO", "HTML"],
    "objectives": [
      "Rendre les liens compréhensibles pour les utilisateurs de lecteurs d'écran.",
      "Permettre aux liens d'être cliquables même si les images ou les styles CSS ne se chargent pas.",
      "Améliorer le référencement (les moteurs de recherche utilisent le texte du lien pour comprendre la cible)."
    ],
    "implementationIntro": "",
    "implementation": [
      "S'assurer que chaque balise <a> contient du texte.",
      "Si le lien est une image, utiliser l'attribut alt.",
      "Si le lien est une icône (SVG/Font), ajouter un texte caché via une classe CSS (ex: .sr-only) ou un attribut aria-label."
    ],
    "control": [
      "Inspecter le code source des liens ne contenant pas de texte visible.",
      "Vérifier la présence d'un mécanisme de remplacement (alt, aria-label, texte caché)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 137,
    "title": "Le libellé de chaque lien décrit sa fonction ou la nature du contenu vers lequel il pointe.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/137",
    "description": "Pour s’en tenir à des contre-exemples fréquents de cette bonne pratique : les libellés de liens « Cliquer ici » et « Lire la suite » ne vous donnent aucune idée de l’endroit où vous allez vous rendre en cliquant dessus.",
    "tags": ["Accessibilité", "Éditorial", "SEO", "Liens"],
    "objectives": [
      "Permettre aux utilisateurs de comprendre la destination d'un lien sans avoir à lire le texte environnant.",
      "Faciliter la navigation pour les utilisateurs de lecteurs d'écran (qui naviguent souvent de lien en lien).",
      "Améliorer le référencement naturel (les mots-clés dans le lien ont du poids)."
    ],
    "implementationIntro": "",
    "implementation": [
      "Remplacer les libellés génériques ('Cliquez ici', 'Lire la suite', 'En savoir plus') par des libellés explicites.",
      "Si une contrainte visuelle impose un libellé court, compléter l'information via un attribut title (avec précaution) ou un texte caché (aria-label ou sr-only)."
    ],
    "control": [
      "Parcourir les liens de la page.",
      "Vérifier si le texte du lien seul suffit à comprendre la destination.",
      "Vérifier l'absence de liens dupliqués ayant le même libellé mais des destinations différentes."
    ],
    "screenshotsSources": []
  },
  {
    "id": 138,
    "title": "Les liens de même nature ont des couleurs, des formes et des comportements identiques sur toutes les pages.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/138",
    "description": "Dès l’arrivée sur votre site, que ce soit par l’accueil ou par une page intérieure, les internautes vont commencer à « apprendre » votre interface. Cette règle a pour objectif d’accélérer leur apprentissage.",
    "tags": ["Design", "UX", "CSS", "Accessibilité"],
    "objectives": [
      "Réduire la charge cognitive de l'utilisateur (ne pas lui faire deviner ce qui est cliquable).",
      "Assurer une navigation fluide et prédictible à travers tout le site.",
      "Renforcer l'identité visuelle et le professionnalisme de l'interface."
    ],
    "implementationIntro": "",
    "implementation": [
      "Définir une charte graphique web (Design System) stricte pour les éléments interactifs.",
      "Utiliser des classes CSS globales pour les liens (ex: .btn-primary, .link-text) et éviter les styles inline.",
      "Vérifier la cohérence des états :hover et :focus sur l'ensemble du site."
    ],
    "control": [
      "Naviguer entre plusieurs pages (Accueil, Liste, Détail, Admin).",
      "Vérifier que les liens de navigation, les liens contextuels et les boutons d'action conservent le même style visuel pour la même fonction."
    ],
    "screenshotsSources": []
  },
  {
    "id": 139,
    "title": "Le soulignement est réservé aux liens.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/139",
    "description": "Les internautes sont habitués à associer les contenus soulignés à des liens. En soulignant des contenus qui ne sont pas des liens, vous allez provoquer des clics inutiles. Attention, cette règle ne vous impose pas pour autant de souligner vos liens.",
    "tags": ["Design", "UX", "CSS", "Conventions"],
    "objectives": [
      "Éviter la confusion entre les éléments interactifs et le texte statique.",
      "Réduire le nombre de clics inutiles (clics de frustration).",
      "Respecter les conventions historiques du Web."
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser le gras (font-weight) ou l'italique pour l'emphase, jamais le soulignement.",
      "Réserver la propriété CSS 'text-decoration: underline' exclusivement aux balises <a>.",
      "Vérifier que les styles de titres (h1-h6) n'incluent pas de soulignement qui pourrait prêter à confusion."
    ],
    "control": [
      "Parcourir les pages et repérer le texte souligné.",
      "Vérifier que tout texte souligné est bien un lien cliquable.",
      "Vérifier que les éléments importants (mises en garde, notes) utilisent le gras ou la couleur, pas le soulignement."
    ],
    "screenshotsSources": []
  },
  {
    "id": 140,
    "title": "Les liens sont visuellement différenciés du reste du contenu.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/140",
    "description": "Certains créateurs de sites adorent différencier les liens uniquement au survol. Dans ce cas, un utilisateur qui ne peut pas survoler une page avec son pointeur ne verra pas les liens. Est-ce si rare ? Pensons par exemple aux utilisateurs d’écrans tactiles et à la navigation en mode vocal.",
    "tags": ["Accessibilité", "Design", "Mobile", "UX"],
    "objectives": [
      "Rendre les liens identifiables sans interaction (pas besoin de survoler).",
      "Garantir l'accès aux liens sur les terminaux tactiles (smartphones, tablettes).",
      "Améliorer l'accessibilité visuelle pour les malvoyants."
    ],
    "implementationIntro": "",
    "implementation": [
      "Distinguer les liens du texte environnant par un autre moyen que la seule couleur (ex: soulignement, gras, icône).",
      "Si la couleur est le seul moyen, assurer un contraste fort (ratio 3:1) avec le texte normal.",
      "Ne jamais supprimer l'outline de focus sans le remplacer."
    ],
    "control": [
      "Observer la page sans toucher à la souris.",
      "Vérifier si l'on peut identifier tous les liens au premier coup d'œil."
    ],
    "screenshotsSources": []
  },
  {
    "id": 141,
    "title": "Les liens visités et non visités sont visuellement différenciés.",
    "authors": ["ROMAIN DANIEL"],
    "path": "/rules/141",
    "description": "Par défaut, les feuilles de styles des navigateurs prévoient des couleurs différentes pour les liens visités et non visités. Il est fort légitime de changer ce bleu et ce mauve fort peu seyants, mais pourquoi ne pas maintenir cette différence utile au visiteur ?",
    "tags": ["Design", "UX", "CSS", "Navigation"],
    "objectives": [
      "Permettre à l'utilisateur de repérer les pages qu'il a déjà consultées.",
      "Éviter les clics redondants et la désorientation.",
      "Faciliter l'exploration méthodique d'une liste de liens."
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser la pseudo-classe CSS :visited pour définir une couleur distincte.",
      "S'assurer que le contraste reste suffisant pour les deux états (visité et non visité)."
    ],
    "control": [
      "Cliquer sur un lien dans une liste.",
      "Revenir à la page précédente.",
      "Vérifier que le lien cliqué a changé d'aspect visuel (couleur)."
    ],
    "screenshotsSources": []
=======
>>>>>>> 77fe9cba95cc798351172cb8f4e222771e4a30d4
  }
]
